I just tried that and got the same error but I just noticed that the terraform plan translated the boolean into a string.

```
+ resource "google_org_policy_policy" "primary" {
      + id     = (known after apply)
      + name   = "projects/xxx/policies/gcp.resourceLocations"
      + parent = "projects/xxx"

      + spec {
          + etag        = (known after apply)
          + update_time = (known after apply)

          + rules {
              + condition {
                  + description = "A sample condition for the policy"
                  + expression  = "resource.matchLabels('labelKeys/123', 'labelValues/345')"
                  + location    = "sample-location.log"
                  + title       = "sample-condition"
                }
              + values {
                  + allowed_values = [
                      + "projects/allowed-project",
                    ]
                  + denied_values  = [
                      + "projects/denied-project",
                    ]
                }
            }
          + rules {
              + allow_all = "true"
            }
        }
    }
```

The log file output is interesting; it is missing the second rule values (on both mine and yours). 

```
    "request": {
      "policy": {
        "spec": {
          "inheritFromParent": false,
          "reset": false,
          "rules": [
            {
              "condition": {
                "title": "sample-condition",
                "description": "A sample condition for the policy",
                "location": "sample-location.log",
                "expression": "resource.matchLabels('labelKeys/123', 'labelValues/345')"
              },
              "values": {
                "allowedValues": [
                  "projects/allowed-project"
                ],
                "deniedValues": [
                  "projects/denied-project"
                ]
              }
            },
            {}
          ]
        },
        "name": "projects/xxx/policies/gcp.resourceLocations"
      },
```

What versions of terraform / provider are you using? I've just noticed I posted the wrong values above, I took them from my local rather than the pipeline. 

Should have been:
```
Terraform v1.4.4
on linux_amd64
provider registry.terraform.io/hashicorp/google v4.61.0
provider registry.terraform.io/hashicorp/google-beta v4.61.0
```

This code works fine if you change the true to "TRUE". I'm assuming the bug is in the translation of the boolean to string or string to uppercase. Would be much easier if the interface was just defined as boolean as in the "inherit_from_parent" field. 